/* Задача 15: Напишите программу, которая принимает на вход цифру,
обозначающую день недели, и проверяет, является ли этот день выходным.
6 -> да
7 -> да
1 -> нет
*/
string[] daysOfTheWeek = {"Понедельник", "Вторник", "Среда",
      "Четверг", "Пятница", "Суббота", "Воскресенье"};
Console.WriteLine("Введите порядковый номер интересующего дня недели, с 1 по 7 включительно,");
Console.Write("например, Понедельник - 1, Вторник - 2, Воскресенье - 7: ");
int i = int.Parse(Console.ReadLine()) - 1;
if (i == 5 || i == 6)
{
    Console.WriteLine($"{daysOfTheWeek[i]} - Да, этот день - выходной!.");
}
else
{
    Console.WriteLine($"{daysOfTheWeek[i]} - нет, этот день - рабочий.");
}

